#Задание №3
#import this #Философия Python
#import antigravity #Открывает в браузере комикс
#import __hello__ #Замороженный модуль, который выдает результат "Hello world"
#from __future__ import braces #Будущее утверждение - это директива для компилятора о том, что определенный модуль должен быть скомпилирован с использованием синтаксиса или семантики, которые будут доступны в указанном будущем выпуске Python. Будущее утверждение предназначено для облегчения перехода на будущие версии Python, которые вносят несовместимые изменения в язык

#Задание №4
from art import *
tprint("Viktor")

#Задание №5
a=int(input("Введите число A:"))
b=int(input("Введите число B:"))
symma=(a+b)
delenie=(a//b)
ostatok=(a%b)
stepen=(a**b)
print("Сумма чисел:",symma)
print("Целочисленное деления:",delenie)
print("Остаток от деления:",ostatok)
print("Степень числа:",stepen)