#Задание №1
privet = input("Введите Ваше имя: ")
print("Hello, " +privet,"!")

