#Задание №7**
number=int(input("Укажите желаемое кол-во звёздочек: "))
print ("*" * number)

