#Задание #6*
x=abs(float(input("Введите значение для поиска в списке: ")))
a=[10,20,30,40,50,60,70,80,90,100]
if x in y:
        print("Число", x,"присутствует в списке")
    else:
        print("Число", x,"отсутствует в списке")
